tap "anomalyco/tap"
tap "jandedobbeleer/oh-my-posh"

## Tools
brew "atuin"
brew "awscli"
brew "curl"
brew "delta"
brew "direnv"
brew "eza"
brew "fastfetch"
brew "fnm"
brew "fzf"
brew "libpq", link: true
brew "midnight-commander"
brew "neovim"
brew "stow"
brew "unzip"
brew "zinit"
brew "zoxide"
brew "anomalyco/tap/opencode"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"

## Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"

## Apps
cask "1password"
cask "cursor"
cask "docker-desktop"
cask "font-sf-mono-for-powerline"
cask "ghostty"
cask "google-chrome"
cask "maccy"
cask "raycast"
cask "session-manager-plugin"
cask "slack"
cask "zoom"

## Cursor extensions
vscode "anysphere.remote-ssh"
vscode "tamasfe.even-better-toml"
